# SaveAsOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SaveAsOptions Class
Members See Also
---
This class contains options available for saving a document to disk with a new filename.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class SaveAsOptions : IDisposable
```

Visual Basic
---
```text
Public Class SaveAsOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SaveAsOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SaveAsOptions
# See Also
SaveAsOptions Members
Autodesk.Revit.DB Namespace